Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAML21J16A.xml
        <register name="SEQCTRL" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="Sequence Control">
          <bitfield name="SEQEN" caption="Enable Positive Input in the Sequence" mask="0xFFFFFFFF"/>
        </register>
        <register name="CALIB" offset="0x2C" rw="RW" size="2" initval="0x0000" caption="Calibration">
          <bitfield name="BIASCOMP" caption="Bias Comparator Scaling" mask="0x7"/>
          <bitfield name="BIASREFBUF" caption="Bias  Reference Buffer Scaling" mask="0x700"/>
        </register>
      </register-group>
      <value-group name="ADC_CTRLB__PRESCALER">
        <value name="DIV2" caption="Peripheral clock divided by 2" value="0x0"/>
        <value name="DIV4" caption="Peripheral clock divided by 4" value="0x1"/>
        <value name="DIV8" caption="Peripheral clock divided by 8" value="0x2"/>
        <value name="DIV16" caption="Peripheral clock divided by 16" value="0x3"/>
        <value name="DIV32" caption="Peripheral clock divided by 32" value="0x4"/>
        <value name="DIV64" caption="Peripheral clock divided by 64" value="0x5"/>
        <value name="DIV128" caption="Peripheral clock divided by 128" value="0x6"/>
        <value name="DIV256" caption="Peripheral clock divided by 256" value="0x7"/>
      </value-group>
      <value-group name="ADC_REFCTRL__REFSEL">
        <value name="INTREF" caption="Internal Bandgap Reference" value="0x0"/>
        <value name="INTVCC0" caption="1/1.6 VDDANA" value="0x1"/>
        <value name="INTVCC1" caption="1/2 VDDANA" value="0x2"/>
        <value name="AREFA" caption="External Reference" value="0x3"/>
        <value name="AREFB" caption="External Reference" value="0x4"/>
        <value name="INTVCC2" caption="VCCANA" value="0x5"/>
      </value-group>
      <value-group name="ADC_INPUTCTRL__MUXNEG">
        <value name="AIN0" caption="ADC AIN0 Pin" value="0x0"/>
        <value name="AIN1" caption="ADC AIN1 Pin" value="0x1"/>
        <value name="AIN2" caption="ADC AIN2 Pin" value="0x2"/>
        <value name="AIN3" caption="ADC AIN3 Pin" value="0x3"/>
        <value name="AIN4" caption="ADC AIN4 Pin" value="0x4"/>
        <value name="AIN5" caption="ADC AIN5 Pin" value="0x5"/>
        <value name="AIN6" caption="ADC AIN6 Pin" value="0x6"/>
        <value name="AIN7" caption="ADC AIN7 Pin" value="0x7"/>
      </value-group>
      <value-group name="ADC_INPUTCTRL__MUXPOS">
        <value name="AIN0" caption="ADC AIN0 Pin" value="0x0"/>
        <value name="AIN1" caption="ADC AIN1 Pin" value="0x1"/>
        <value name="AIN2" caption="ADC AIN2 Pin" value="0x2"/>
        <value name="AIN3" caption="ADC AIN3 Pin" value="0x3"/>
        <value name="AIN4" caption="ADC AIN4 Pin" value="0x4"/>
        <value name="AIN5" caption="ADC AIN5 Pin" value="0x5"/>
        <value name="AIN6" caption="ADC AIN6 Pin" value="0x6"/>
        <value name="AIN7" caption="ADC AIN7 Pin" value="0x7"/>
        <value name="AIN8" caption="ADC AIN8 Pin" value="0x8"/>
        <value name="AIN9" caption="ADC AIN9 Pin" value="0x9"/>
        <value name="AIN10" caption="ADC AIN10 Pin" value="0xA"/>
        <value name="AIN11" caption="ADC AIN11 Pin" value="0xB"/>
        <value name="AIN12" caption="ADC AIN12 Pin" value="0xC"/>
        <value name="AIN13" caption="ADC AIN13 Pin" value="0xD"/>
        <value name="AIN14" caption="ADC AIN14 Pin" value="0xE"/>
        <value name="AIN15" caption="ADC AIN15 Pin" value="0xF"/>
        <value name="AIN16" caption="ADC AIN16 Pin" value="0x10"/>
        <value name="AIN17" caption="ADC AIN17 Pin" value="0x11"/>
        <value name="AIN18" caption="ADC AIN18 Pin" value="0x12"/>
        <value name="AIN19" caption="ADC AIN19 Pin" value="0x13"/>
        <value name="AIN20" caption="ADC AIN20 Pin" value="0x14"/>
        <value name="AIN21" caption="ADC AIN21 Pin" value="0x15"/>
        <value name="AIN22" caption="ADC AIN22 Pin" value="0x16"/>
        <value name="AIN23" caption="ADC AIN23 Pin" value="0x17"/>
        <value name="TEMP" caption="Temperature Sensor" value="0x18"/>
        <value name="BANDGAP" caption="Bandgap Voltage" value="0x19"/>
        <value name="SCALEDCOREVCC" caption="1/4 Scaled Core Supply" value="0x1A"/>
        <value name="SCALEDIOVCC" caption="1/4 Scaled I/O Supply" value="0x1B"/>
        <value name="DAC" caption="DAC Output" value="0x1C"/>
        <value name="SCALEDVBAT" caption="1/4 Scaled VBAT Supply" value="0x1D"/>
        <value name="OPAMP01" caption="OPAMP0 or OPAMP1 output" value="0x1E"/>
        <value name="OPAMP2" caption="OPAMP2 output" value="0x1F"/>
      </value-group>
      <value-group name="ADC_CTRLC__RESSEL">
        <value name="12BIT" caption="12-bit result" value="0x0"/>
        <value name="16BIT" caption="For averaging mode output" value="0x1"/>
        <value name="10BIT" caption="10-bit result" value="0x2"/>
        <value name="8BIT" caption="8-bit result" value="0x3"/>
      </value-group>
      <value-group name="ADC_CTRLC__WINMODE">
        <value name="DISABLE" caption="No window mode (default)" value="0"/>
        <value name="MODE1" caption="RESULT &gt; WINLT" value="1"/>
        <value name="MODE2" caption="RESULT &lt; WINUT" value="2"/>
        <value name="MODE3" caption="WINLT &lt; RESULT &lt; WINUT" value="3"/>
        <value name="MODE4" caption="!(WINLT &lt; RESULT &lt; WINUT)" value="4"/>
      </value-group>
      <value-group name="ADC_AVGCTRL__SAMPLENUM">
        <value name="1" caption="1 sample" value="0x0"/>
        <value name="2" caption="2 samples" value="0x1"/>
        <value name="4" caption="4 samples" value="0x2"/>
        <value name="8" caption="8 samples" value="0x3"/>
        <value name="16" caption="16 samples" value="0x4"/>
        <value name="32" caption="32 samples" value="0x5"/>
        <value name="64" caption="64 samples" value="0x6"/>
        <value name="128" caption="128 samples" value="0x7"/>
        <value name="256" caption="256 samples" value="0x8"/>
        <value name="512" caption="512 samples" value="0x9"/>
        <value name="1024" caption="1024 samples" value="0xA"/>
      </value-group>
    </module>
    <module name="AES" id="U2238" version="2.0.0" caption="Advanced Encryption Standard">
      <register-group name="AES" caption="Advanced Encryption Standard">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="AESMODE" caption="AES Modes of operation" mask="0x1C"/>
          <bitfield name="CFBS" caption="CFB Types" mask="0xE0"/>
          <bitfield name="KEYSIZE" caption="Keysize" mask="0x300"/>
          <bitfield name="CIPHER" caption="Cipher mode" mask="0x400"/>
          <bitfield name="STARTMODE" caption="Start mode" mask="0x800"/>
          <bitfield name="LOD" caption="LOD Enable" mask="0x1000"/>
          <bitfield name="KEYGEN" caption="Last key generation" mask="0x2000"/>
          <bitfield name="XORKEY" caption="Xor Key operation" mask="0x4000"/>
          <bitfield name="CTYPE" caption="Counter measure types" mask="0xF0000"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="1" initval="0x00" caption="Control B">
          <bitfield name="START" caption="Manual Start" mask="0x1"/>
          <bitfield name="NEWMSG" caption="New message" mask="0x2"/>
          <bitfield name="EOM" caption="End of message" mask="0x4"/>
          <bitfield name="GFMUL" caption="GF Multiplication" mask="0x8"/>
        </register>
        <register name="INTENCLR" offset="0x5" rw="RW" size="1" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="ENCCMP" caption="Encryption Complete" mask="0x1" values="AES_INTENCLR__ENCCMP"/>
          <bitfield name="GFMCMP" caption="GF Multiplication Complete" mask="0x2"/>
        </register>
