Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAML21J16A.xml
        <register offset="0x00000180" size="4" name="NVICICPR" initval="0" caption="Interrupt Clear Pending Register">
          <bitfield mask="0xffffffff" name="CLRPEND" caption="Interrupt clear-pending bits"/>
        </register>
        <register offset="0x00000300" size="4" name="NVICIPR0" initval="0" caption="Interrupt Priority Register 0">
          <bitfield mask="0x000000ff" name="PRI0" caption="Priority of interrupt 0"/>
          <bitfield mask="0x0000ff00" name="PRI1" caption="Priority of interrupt 1"/>
          <bitfield mask="0x00ff0000" name="PRI2" caption="Priority of interrupt 2"/>
          <bitfield mask="0xff000000" name="PRI3" caption="Priority of interrupt 3"/>
        </register>
        <register offset="0x00000304" size="4" name="NVICIPR1" initval="0" caption="Interrupt Priority Register 1">
          <bitfield mask="0x000000ff" name="PRI4" caption="Priority of interrupt 4"/>
          <bitfield mask="0x0000ff00" name="PRI5" caption="Priority of interrupt 5"/>
          <bitfield mask="0x00ff0000" name="PRI6" caption="Priority of interrupt 6"/>
          <bitfield mask="0xff000000" name="PRI7" caption="Priority of interrupt 7"/>
        </register>
        <register offset="0x00000308" size="4" name="NVICIPR2" initval="0" caption="Interrupt Priority Register 2">
          <bitfield mask="0x000000ff" name="PRI8" caption="Priority of interrupt 8"/>
          <bitfield mask="0x0000ff00" name="PRI9" caption="Priority of interrupt 9"/>
          <bitfield mask="0x00ff0000" name="PRI10" caption="Priority of interrupt 10"/>
          <bitfield mask="0xff000000" name="PRI11" caption="Priority of interrupt 11"/>
        </register>
        <register offset="0x0000030C" size="4" name="NVICIPR3" initval="0" caption="Interrupt Priority Register 3">
          <bitfield mask="0x000000ff" name="PRI12" caption="Priority of interrupt 12"/>
          <bitfield mask="0x0000ff00" name="PRI13" caption="Priority of interrupt 13"/>
          <bitfield mask="0x00ff0000" name="PRI14" caption="Priority of interrupt 14"/>
          <bitfield mask="0xff000000" name="PRI15" caption="Priority of interrupt 15"/>
        </register>
        <register offset="0x00000310" size="4" name="NVICIPR4" initval="0" caption="Interrupt Priority Register 4">
          <bitfield mask="0x000000ff" name="PRI16" caption="Priority of interrupt 16"/>
          <bitfield mask="0x0000ff00" name="PRI17" caption="Priority of interrupt 17"/>
          <bitfield mask="0x00ff0000" name="PRI18" caption="Priority of interrupt 18"/>
          <bitfield mask="0xff000000" name="PRI19" caption="Priority of interrupt 19"/>
        </register>
        <register offset="0x00000314" size="4" name="NVICIPR5" initval="0" caption="Interrupt Priority Register 5">
          <bitfield mask="0x000000ff" name="PRI20" caption="Priority of interrupt 20"/>
          <bitfield mask="0x0000ff00" name="PRI21" caption="Priority of interrupt 21"/>
          <bitfield mask="0x00ff0000" name="PRI22" caption="Priority of interrupt 22"/>
          <bitfield mask="0xff000000" name="PRI23" caption="Priority of interrupt 23"/>
        </register>
        <register offset="0x00000318" size="4" name="NVICIPR6" initval="0" caption="Interrupt Priority Register 6">
          <bitfield mask="0x000000ff" name="PRI24" caption="Priority of interrupt 24"/>
          <bitfield mask="0x0000ff00" name="PRI25" caption="Priority of interrupt 25"/>
          <bitfield mask="0x00ff0000" name="PRI26" caption="Priority of interrupt 26"/>
          <bitfield mask="0xff000000" name="PRI27" caption="Priority of interrupt 27"/>
        </register>
        <register offset="0x0000031C" size="4" name="NVICIPR7" initval="0" caption="Interrupt Priority Register 7">
          <bitfield mask="0x000000ff" name="PRI28" caption="Priority of interrupt 28"/>
          <bitfield mask="0x0000ff00" name="PRI29" caption="Priority of interrupt 29"/>
          <bitfield mask="0x00ff0000" name="PRI30" caption="Priority of interrupt 30"/>
          <bitfield mask="0xff000000" name="PRI31" caption="Priority of interrupt 31"/>
        </register>
      </register-group>
    </module>
  </modules>
</avr-tools-device-file>
